// ไฟล์นี้สำหรับเก็บข้อมูลโจทย์เกม

const gamesDatabase = {
    "2026-02-06": {
        groups: [
            { category: "ตั้ง___", words: ["ครรภ์", "วง", "โอ๋", "ใจ"], color: "#c2410c" },
            { category: "น้ำ___", words: ["ค้าง", "เชื่อม", "ตาล", "พริก"], color: "#047857" },
            { category: "คัด___", words: ["ลายมือ", "ค้าน", "เลือก", "เค้า"], color: "#0e7490" },
            { category: "ลูก___", words: ["รอก", "ค้า", "ขุน", "จ้าง"], color: "#6d28d9" }
        ]
    },
    "2026-02-05": {
        groups: [
            { category: "สารที่เป็นของเหลว", words: ["นม", "น้ำผึ้ง", "เลือด", "ซอส"], color: "#c2410c" },
            { category: "การใช้เวลามาก", words: ["โอ้เอ้วิหารราย", "ตะบอย", "แชเชือน", "อืดอาด"], color: "#047857" },
            { category: "___เสียง", words: ["ระดับ", "น้ำ", "หาง", "กล่อง"], color: "#0e7490" },
            { category: "ทำนองร้อยกรองไทย", words: ["เสภา", "เห่เรือ", "สรภัญญะ", "พากย์โขน"], color: "#6d28d9" }
        ],
        author: "baeyeoju",
        editor: "baeyeoju"
    },
    "2026-02-04": {
        groups: [
            { category: "สรรพนามบุรุษที่ 1", words: ["หนู", "ผม", "ฉัน", "เรา"], color: "#c2410c" },
            { category: "ดารากะเทยไทย", words: ["ม้า", "โกโก้", "นัท", "มิกซ์"], color: "#047857" },
            { category: "เครื่องดื่มมีคาเฟอีน", words: ["ชาเขียว", "คอมบูฉะ", "กาแฟ", "น้ำอัดลม"], color: "#0e7490" },
            { category: "สัตว์เลื้อยคลาน", words: ["เต่า", "จระเข้", "กิ้งก่า", "งู"], color: "#6d28d9" }
        ]
    }
};
